Revit 2027 API
KeyBasedTreeEntry.ParentKey Property
 The parent key of this entry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ParentKey { get; }
Public ReadOnly Property ParentKey As String
	Get
public:
property String^ ParentKey {
	String^ get ();
}
member ParentKey : string with get
Property Value
String
Remarks
 This value will be the empty string if this entry does not have a parent.
See Also
Reference
KeyBasedTreeEntry Class
Autodesk.Revit.DB Namespace